// Copyright 2021 by mila
/*
Prey - рыба-жертва. Передвигается случайным образом по океану, размножается и умирает через заданные промежутки времени.
*/
/*
В результате "жизнедеятельности" объектов в океане происходят следующие события:

живые объекты хаотично перемещаются в соседние ячейки;
живые объекты размножаются, питаются и умирают;
Моделирование продолжается до тех пор, пока:

пользователь не прерывает процесс;
в океане заканчивается пища - объекты Prey;
в океане заканчиваются хищники - объекты Predators;

*/
